all_articles = [
    {"title": "Как получить подарок на день рождения",
     "content": "Чтобы получить подарок, вам нужно быть постоянно нанятым штатным сотудником..."},
    {"title": "Как взять отпуск",
     "content": "Каждому сотруднику полагается 35 дней отпуска в год. "
                "Чтобы уйти в отпуск, его нужно согласовать с руководителем..."},
    {"title": "Как мыть руки", "content": "Руки нужно мыть тщательно..."},
]


def get_article(articles, title):  # Функция должна вернуть словарь как в пример
    ...


def show_article(article):  # функция должна печатать заголовок и контент на разных строках
    ...
