import csv

social_media_posts = [
    {"дата": "1 января 2024", "платформа": "телеграм", "количество лайков": 150, "количество комментариев": 20,
     "количество репостов": 5},
    {"дата": "3 января 2024", "платформа": "яндекс дзен", "количество лайков": 200, "количество комментариев": 15,
     "количество репостов": 10},
    {"дата": "5 января 2024", "платформа": "вконтакте", "количество лайков": 300, "количество комментариев": 30,
     "количество репостов": 8},
    {"дата": "7 января 2024", "платформа": "телеграм", "количество лайков": 180, "количество комментариев": 25,
     "количество репостов": 6},
    {"дата": "10 января 2024", "платформа": "яндекс дзен", "количество лайков": 220, "количество комментариев": 18,
     "количество репостов": 12},
    {"дата": "12 января 2024", "платформа": "вконтакте", "количество лайков": 350, "количество комментариев": 40,
     "количество репостов": 15},
    {"дата": "15 января 2024", "платформа": "телеграм", "количество лайков": 160, "количество комментариев": 22,
     "количество репостов": 7},
    {"дата": "18 января 2024", "платформа": "яндекс дзен", "количество лайков": 210, "количество комментариев": 19,
     "количество репостов": 9},
    {"дата": "20 января 2024", "платформа": "вконтакте", "количество лайков": 320, "количество комментариев": 35,
     "количество репостов": 10},
    {"дата": "23 января 2024", "платформа": "телеграм", "количество лайков": 170, "количество комментариев": 23,
     "количество репостов": 8},
]

# ваш код
...


# Распечатывать результат не нужно, файл проверяется автоматически
