"""
У вас есть список сотрудников, в порядке их найма
Выведите сотрудников, которые присоединились к вашему отделу первым и последним.


Пример вывода:
Алексева
Данилевич

Исходный код:
employees = ["Алексева", "Ягодкин", "Хвостатов", "Данилевич"]

print(...)
print(...)
"""

""" Выполненное задание """

employees = ["Алексева", "Ягодкин", "Хвостатов", "Данилевич"]

print(employees[0])
print(employees[-1])