reviews = [
    {'name': 'Алексей', 'text': 'Игра неплохая, но много багов.', 'r': 3},
    {'name': 'Мария', 'text': 'Очень понравилась графика и сюжет!', 'r': 5},
    {'name': 'Иван', 'text': 'Неудобное управление. И вообще скучно.', 'r': 2},
    {'name': 'Ольга', 'text': 'Много рекламы, не хватает контента.', 'r': 1},
    {'name': 'Василий', 'text': 'Отличная игра, затягивает!', 'r': 4},
    {'name': 'Наталья', 'text': 'Средненькая игра, на один раз.', 'r': 3},
    {'name': 'Дмитрий', 'text': 'Полностью разочарован, ждал большего', 'r': 2},
    {'name': 'Светлана', 'text': 'Просто ужасно, игра не стоит денег.', 'r': 1},
    {'name': 'Егор', 'text': 'Мне понравилось, хоть и не шедевр.', 'r': 3},
    {'name': 'Анна', 'text': 'Очень захватывающая, рекомендую!', 'r': 5},
]

# ваш код
...
