presentations = [
    {'title': 'Введение в ИИ для генерации контента для поисковиков', 'duration': 45, 'topic': 'Искусственный интеллект'},
    {'title': 'Машинное обучение и его применение в продажах', 'duration': 60, 'topic': 'Искусственный интеллект'},
    {'title': 'Введение в No-code и Low-code разработку','duration': 30, 'topic': 'Веб-разработка'},
    {'title': 'Нейронные сети и глубокое обучение', 'duration': 30, 'topic': 'Искусственный интеллект'},
    {'title': 'Разработка мобильных приложений', 'duration': 40, 'topic': 'Мобильная разработка'},
    {'title': 'Этика при сборе данных', 'duration': 25, 'topic': 'Юридические вопросы'},
]

# ваш код
...
