import pprint

from checker import SberChecker

tests = [
    {
        "input": ['60'],
        "output": ["['Новикова Ольга 120%', 'Васильев Константин 104%', 'Морозова Алина 102%']"],
    },
    {
        "input": ['81'],
        "output": ["['Новикова Ольга 120%', 'Васильев Константин 104%', 'Морозова Алина 102%', "
                   "'Федоров Михаил 102%', 'Петрова Мария 99%']"],
    },
    {
        "input": ['100'],
        "output": ["['Новикова Ольга 120%', 'Васильев Константин 104%', 'Морозова Алина 102%', "
                   "'Федоров Михаил 102%', 'Петрова Мария 99%', 'Волков Роман 98%', 'Мельникова Анна 98%']"],
    }
]

checker = SberChecker(
    filename="task_3.py",
    tests=tests
)

results = checker.run()

pprint.pprint(results)
