manager = input('Менеджер: ')
designer = input('Дизайнер: ')
developer = input('Разработчик: ')
pr = input('PR: ')

text = """
На сегодняшней встрече со стороны подрядчика присутствуют следующие специалисты:
MANAGER — менеджер проекта, основной канал коммуникации.
DESIGNER — лучший дизайнер компании.
За разработку приложения отвечает старший разработчик DEVELOPER.
Пиаром будет заниматься PR — специалист, обладающий весьма нестандартным и успешным подходом к решению проблем."""

# Ваш код
...