'''
Создайте переменную wind и впишите туда значение False.
Выведите текст "Дует ли ветер: x", где вместо x будет значение переменной wind.
'''

wind = False
print(f'Дует ли ветер: {wind}')