reviews = [
    {
        "name": "Анна",
        "grade": 8,
        "comment": "Хороший сервис, но хотелось бы больше удобных опций."
    },
    {
        "name": "Олег",
        "grade": 9,
        "comment": "Очень доволен, практически все устроило!"
    },
    {
        "name": "Ирина",
        "grade": 7,
        "comment": "Неплохо, но могли бы улучшить поддержку клиентов."
    },
    {
        "name": "Максим",
        "grade": 10,
        "comment": "Отлично! Воспользуюсь еще раз."
    },
    {
        "name": "Светлана",
        "grade": 6,
        "comment": "Средний опыт, есть куда расти."
    },
    {
        "name": "Дмитрий",
        "grade": 4,
        "comment": "Не совсем доволен, сталкивался с трудностями."
    }
]

# Ваш код
def sort_by_grade(reviews_list):
    ...
    return ...

# Функция должна возвращать первые три положительных комментария в виде списка