"""
Вы собрались посетить конференцию по управлению цифровыми продуктами.
Создайте два списка с названиями докладов на два дня:

День 1
Блиц-аналитика
Продуктовые исследования
Как транслировать стратегию компании

День 2
Гибридные методологии управления
OKR в управлении
Применение AI
```

Исходный код:
day_1 = [
   "Блиц-аналитика",
   ...
]

day_2 = ...
"""

""" Выполненное задание """

day_1 = ["Блиц-аналитика", "Продуктовые исследования", "Как транслировать стратегию компании",]

day_2 = ["Гибридные методологии управления", "OKR в управлении", "Применение AI",]