make_microchip = int(input("Вы можете сделать микрочип?\n1 — да, 0 — нет\n"))

make_engine = int(input("Вы можете сделать паровой двигатель?\n1 — да, 0 — нет\n"))

mine_bronze = int(input("Вы можете добыть и выплавить бронзу?\n1 — да, 0 — нет\n"))

make_tools = int(
    input("Вы можете сделать каменные инструменты и разжечь огонь с помощью двух палок?\n1 — да, 0 — нет\n")
)

get_out_of_water = int(input("Вы можете похлопотать, чтобы выйти из воды?\n1 — да, 0 — нет\n"))

# Ваш код

print('Вы: Человек компьютерного века')

print('Вы: Человек индустриального века')

print('Вы: Человек бронзового века')

print('Вы: Человек каменного века')

print('Вы: Громоздкое четвероногое')

print('Вы: Первичный бульон')
