"""
В списке указаны сотрудники. Выведите тех, кто занимается фронтендом (frontend).
Для этой проверки используйте оператор `in`.

Исходный код:
employees = [
    "Алексей (frontend): 40",
    "Борис (backend): 38",
    "Виктор (тестирование): 42",
    "Дмитрий (backend): 35",
    "Елена (дизайн): 40",
    "Иван (frontend): 45",
    "Мария (тестирование): 36",
    "Ольга (дизайн): 39",
    "Петр (frontend): 41",
    "Светлана (backend): 37"
]

Пример вывода:
Алексей (frontend): 40
Иван (frontend): 45
Петр (frontend): 41
"""

""" Выполненное задание """

employees = [
    "Алексей (frontend): 40",
    "Борис (backend): 38",
    "Виктор (тестирование): 42",
    "Дмитрий (backend): 35",
    "Елена (дизайн): 40",
    "Иван (frontend): 45",
    "Мария (тестирование): 36",
    "Ольга (дизайн): 39",
    "Петр (frontend): 41",
    "Светлана (backend): 37"
]

for employee in employees:
    if "frontend" in employee:
        print(employee)