"""
Это список ваших клиентов, упорядоченный по прибыльности (сначала самые прибыльные).
Выведите топ-5 своих любимых клиентов.

companies = [
    "AlphaTech Innovations",
    "BetaBuild Solutions",
    "GammaWave Industries",
    "Delta Dynamics",
    "Epsilon Enterprises",
    "ZetaZone Technologies",
    "ThetaGlobal Systems",
    "IotaIntellect Corp",
    "KappaKraft Ventures",
    "LambdaLogic Labs"
]
"""

""" Выполненное задание """

companies = [
    "AlphaTech Innovations",
    "BetaBuild Solutions",
    "GammaWave Industries",
    "Delta Dynamics",
    "Epsilon Enterprises",
    "ZetaZone Technologies",
    "ThetaGlobal Systems",
    "IotaIntellect Corp",
    "KappaKraft Ventures",
    "LambdaLogic Labs"
]

print(companies[:5])